pipeFlowReg/case5_Steady_rad2/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------
echo
#blockMesh
echo "create the geometry from blockMeshDict......"
(runApplication 'blockMesh -region zoneone' )
(runApplication 'blockMesh -region zonetwo' )
echo
#create Regions
echo "splitting the meshe into the region ........"
#(runApplication "splitMeshRegions -cellZones -overwrite") 
echo
# run application
echo "running the application ......."
runApplication $(getApplication)

#------------------------------------------------------------------------------
