pipeFlowReg/case5_Steady_rad2/system/zoneone/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0.1;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-6;
        relTol          0;
    }

    p_rgh
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         GaussSeidel;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance        1e-6;
        relTol           0;
    }

    "(U|h|k|epsilon|R)"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-6;
        relTol           0.1;
    }

    "(U|h|k|epsilon|R)Final"
    {
        $U;
        tolerance        1e-6;
        relTol           0;
    }
    Ii
    {
        solver              PBiCG;
	preconditioner      DILU;
        tolerance           1e-6;
        relTol              0;
        smoother            symGaussSeidel;
        maxIter             5;
        nPostSweeps         1;
    }
    
    G
    {
        solver          GAMG;
        preconditioner  DIC;
	smoother        symGaussSeidel;//$p_rgh;
        tolerance       1e-05;
        relTol          0.1;
    }
}

SIMPLE
{
    momentumPredictor   on;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
    // rhoMin          998;
    // rhoMax          1000;
    residualControl
    {
        p_rgh           1e-10;
        U               1e-10;
        T               1e-10;

        // possibly check turbulence fields
     //   "(k|epsilon|omega)" 1e-3;
         "ILambda.*"     1e-7;
    }
}

relaxationFactors
{
    fields
    {
        rho             1.0;
        p_rgh           0.7;
    }
    equations
    {
        "U.*"           0.5;
        "h.*"           0.5;
     //   "(k|epsilon|R)" 0.7;
         "ILambda.*"     0.7;
    }
}


// ************************************************************************* //
